platformio/platform-ststm32/misc/svd/STM32F768.svd
        <register>
          <name>HUFFSYMB8</name>
          <displayName>HUFFSYMB8</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB9</name>
          <displayName>HUFFSYMB9</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB10</name>
          <displayName>HUFFSYMB10</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB11</name>
          <displayName>HUFFSYMB11</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x23C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB12</name>
          <displayName>HUFFSYMB12</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB13</name>
          <displayName>HUFFSYMB13</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB14</name>
          <displayName>HUFFSYMB14</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB15</name>
          <displayName>HUFFSYMB15</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB16</name>
          <displayName>HUFFSYMB16</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB17</name>
          <displayName>HUFFSYMB17</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB18</name>
          <displayName>HUFFSYMB18</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB19</name>
          <displayName>HUFFSYMB19</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB20</name>
          <displayName>HUFFSYMB20</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB21</name>
          <displayName>HUFFSYMB21</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB22</name>
          <displayName>HUFFSYMB22</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB23</name>
          <displayName>HUFFSYMB23</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB24</name>
          <displayName>HUFFSYMB24</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB25</name>
          <displayName>HUFFSYMB25</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB26</name>
          <displayName>HUFFSYMB26</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB27</name>
          <displayName>HUFFSYMB27</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB28</name>
          <displayName>HUFFSYMB28</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB29</name>
          <displayName>HUFFSYMB29</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB30</name>
          <displayName>HUFFSYMB30</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB31</name>
          <displayName>HUFFSYMB31</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB32</name>
          <displayName>HUFFSYMB32</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB33</name>
          <displayName>HUFFSYMB33</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB34</name>
          <displayName>HUFFSYMB34</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB35</name>
          <displayName>HUFFSYMB35</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x29C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB36</name>
          <displayName>HUFFSYMB36</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB37</name>
          <displayName>HUFFSYMB37</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB38</name>
          <displayName>HUFFSYMB38</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB39</name>
          <displayName>HUFFSYMB39</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB40</name>
          <displayName>HUFFSYMB40</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB41</name>
          <displayName>HUFFSYMB41</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB42</name>
          <displayName>HUFFSYMB42</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB43</name>
          <displayName>HUFFSYMB43</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB44</name>
          <displayName>HUFFSYMB44</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB45</name>
          <displayName>HUFFSYMB45</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB46</name>
          <displayName>HUFFSYMB46</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB47</name>
          <displayName>HUFFSYMB47</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
